public/command-types.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Command Types; Command and Directory Searching</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" >
</head>
<body>
<div id="content" class="content">
<h1 class="title">Command Types; Command and Directory Searching</h1>
<nav class="breadcrumbs">
<a href="/index.html">index</a> <span class="separator">/</span> <span>.</span>
</nav>
<div class="nav-buttons">
<a href="/redirection-and-special-files.html" class="nav-button"><< Redirection and Special Files</a>
<a href="/simple-text-processing.html" class="nav-button">>> Simple Text Processing</a>
</div>
<div id="table-of-contents" role="doc-toc">
<div class="toc-header" onclick="toggleToc()">
<h2>Table of Contents</h2>
<div class="toggle-icon">+</div>
</div>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd2ee666">Types of commands</a></li>
<li><a href="#org7067472"><code>PATH</code></a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd2ee666" class="outline-2">
<h2 id="orgd2ee666">Types of commands</h2>
<div class="outline-text-2" id="text-orgd2ee666">
<p>
There are 3 different kinds of commands:
</p>
<ul class="org-ul">
<li><b>built-in shell commands</b></li>
<li><b>external commands</b> (live in the filesystem)</li>
<li><b>shell functions</b></li>
</ul>

<p>
The <code>type</code> command gives us the type of a given command:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/bin/</span><span style="font-weight: bold;">bash</span><span style="font-weight: bold; font-style: italic;"> -
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">demonstrate the different kinds of commands
</span>
<span style="font-weight: bold;">count_unique_users</span>() {
    who | awk <span style="font-style: italic;">'{ print $1 }'</span> | sort -u | wc -l
}

<span style="font-weight: bold; font-style: italic;">commands</span>=(<span style="font-weight: bold;">cd</span> read pwd test printf count_unique_users ls who sort)

<span style="font-weight: bold;">for</span> cmd<span style="font-weight: bold;"> in</span> <span style="font-style: italic;">"${commands[@]}"</span>; <span style="font-weight: bold;">do</span>
    <span style="font-weight: bold;">type</span> $<span style="font-weight: bold; font-style: italic;">cmd</span>
<span style="font-weight: bold;">done</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">./scripts/describe-commands.sh
</pre>
</div>

<pre class="example" id="org1dc996f">
cd is a shell builtin
read is a shell builtin
pwd is a shell builtin
test is a shell builtin
printf is a shell builtin
count_unique_users is a function
count_unique_users ()
{
    who | awk '{ print $1 }' | sort -u | wc -l
}
ls is /usr/bin/ls
who is /usr/bin/who
sort is /usr/bin/sort
</pre>
</div>
</div>
<div id="outline-container-org7067472" class="outline-2">
<h2 id="org7067472"><code>PATH</code></h2>
<div class="outline-text-2" id="text-org7067472">
<p>
Shell searches for commands in the following order:
</p>
<ol class="org-ol">
<li>special built-ins</li>
<li>functions</li>
<li>"regular" built-ins</li>
<li>external commands</li>
</ol>

<p>
How does the shell find commands that live in the file system?
</p>

<p>
For this, we have the <code>PATH</code> var:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">PATH</span>
</pre>
</div>

<pre class="example">
/home/nasreddin/.nvm/versions/node/v18.19.0/bin:/home/nasreddin/.yarn/bin:/home/nasreddin/.local/bin:/home/nasreddin/.yarn/bin:/home/nasreddin/.local/bin:/home/nasreddin/.cargo/bin:/usr/local/bin:/usr/bin:/bin:/usr/local/sbin:/var/lib/flatpak/exports/bin:/usr/lib/jvm/default/bin:/usr/bin/site_perl:/usr/bin/vendor_perl:/usr/bin/core_perl:/var/lib/snapd/snap/bin:/home/nasreddin/.local/share/gem/ruby/3.0.0/bin:/home/nasreddin/.local/bin:/home/nasreddin/.local/share/gem/ruby/3.0.0/bin:/home/nasreddin/.local/bin
</pre>


<p>
Just a big string of all the paths containing external commands, separated by <code>:</code>!
</p>


<p>
<b>The shell scans this sequencially from colon to colon until it finds the command.</b>
</p>

<p>
We can get the shell to find programs in the current dir:
</p>
<ul class="org-ul">
<li>we can use an empty entry in the path variable: add a leading colon or at the end (probably the best).</li>
<li>or we can put an explicit <code>.</code> in the path variable (probably better at the end)</li>
<li><b>don't do this lol</b></li>
</ul>

<p>
For user, we can have a dir, usually called <code>bin</code>, to hold all our scripts that we want the shell to be able to find. And then we add that dir to the <code>PATH</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">PATH</span>
<span style="font-weight: bold; font-style: italic;">PATH</span>=$<span style="font-weight: bold; font-style: italic;">HOME</span>/.local/bin:$<span style="font-weight: bold; font-style: italic;">PATH</span>
</pre>
</div>

<p>
<b>OBS</b>: We can you the <code>command</code> command to run a specific builtin command (if there is an override)
</p>
<div class="org-src-container">
<pre class="src src-bash">command pwd
</pre>
</div>

<pre class="example">
/home/nasreddin/Prog/bash-learning/notes
</pre>


<p>
<b>OBS</b>: <code>CDPATH</code> var to define a specific path for <code>cd</code> (if path passed is invalid for current dir)
</p>
</div>
</div>
</div>
</body>
</html>
